[Killed] BlockStatement
src/domTicTacToe.js:2:25
 class TicTacToe {
-  constructor(document) {
-    this.X_CLASS = 'x';
-    this.CIRCLE_CLASS = 'circle';
-    this.WINNING_COMBINATIONS = [
-      [0, 1, 2],
-      [3, 4, 5],
-      [6, 7, 8],
-      [0, 3, 6],
-      [1, 4, 7],
-      [2, 5, 8],
-      [0, 4, 8],
-      [2, 4, 6]
-    ];
-    this.cellElements = document.querySelectorAll('[data-cell]');
-    this.board = document.getElementById('board');
-    this.winningMessageElement = document.getElementById('winningMessage');
-    this.restartButton = document.getElementById('restartButton');
-    this.winningMessageTextElement = document.querySelector('[data-winning-message-text]');
-    this.circleTurn = false;
-    this.xScore = 0;
-    this.oScore = 0;
-    this.drawScore = 0;
-    this.scoreElement = document.getElementById('score');
-    this.startGame();
-  }
+  constructor(document) {}
 
   startGame() {
killedBy: Game starts correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] ArrayDeclaration
src/domTicTacToe.js:5:33
   constructor(document) {
     this.X_CLASS = 'x';
     this.CIRCLE_CLASS = 'circle';
-    this.WINNING_COMBINATIONS = [
-      [0, 1, 2],
-      [3, 4, 5],
-      [6, 7, 8],
-      [0, 3, 6],
-      [1, 4, 7],
-      [2, 5, 8],
-      [0, 4, 8],
-      [2, 4, 6]
-    ];
+    this.WINNING_COMBINATIONS = [];
     this.cellElements = document.querySelectorAll('[data-cell]');
     this.board = document.getElementById('board');
killedBy: Game identifies a win correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ArrayDeclaration
src/domTicTacToe.js:6:7
     this.X_CLASS = 'x';
     this.CIRCLE_CLASS = 'circle';
     this.WINNING_COMBINATIONS = [
-      [0, 1, 2],
+      [],
       [3, 4, 5],
       [6, 7, 8],
killedBy: Game identifies O win correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "O's Wins!"
Received: "X's Wins!"

[Killed] ArrayDeclaration
src/domTicTacToe.js:10:7
       [3, 4, 5],
       [6, 7, 8],
       [0, 3, 6],
-      [1, 4, 7],
+      [],
       [2, 5, 8],
       [0, 4, 8],
killedBy: Game identifies O win correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "O's Wins!"
Received: "X's Wins!"

[Killed] ArrayDeclaration
src/domTicTacToe.js:12:7
       [0, 3, 6],
       [1, 4, 7],
       [2, 5, 8],
-      [0, 4, 8],
+      [],
       [2, 4, 6]
     ];
killedBy: Game identifies O win correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "O's Wins!"
Received: "X's Wins!"

[Killed] StringLiteral
src/domTicTacToe.js:15:51
       [0, 4, 8],
       [2, 4, 6]
     ];
-    this.cellElements = document.querySelectorAll('[data-cell]');
+    this.cellElements = document.querySelectorAll("");
     this.board = document.getElementById('board');
     this.winningMessageElement = document.getElementById('winningMessage');
killedBy: Game starts correctly
statusReason: SyntaxError: '' is not a valid selector

[Killed] StringLiteral
src/domTicTacToe.js:17:58
     ];
     this.cellElements = document.querySelectorAll('[data-cell]');
     this.board = document.getElementById('board');
-    this.winningMessageElement = document.getElementById('winningMessage');
+    this.winningMessageElement = document.getElementById("");
     this.restartButton = document.getElementById('restartButton');
     this.winningMessageTextElement = document.querySelector('[data-winning-message-text]');
killedBy: Game starts correctly
statusReason: TypeError: Cannot read properties of null (reading 'classList')

[Survived] StringLiteral
src/domTicTacToe.js:18:50
     this.cellElements = document.querySelectorAll('[data-cell]');
     this.board = document.getElementById('board');
     this.winningMessageElement = document.getElementById('winningMessage');
-    this.restartButton = document.getElementById('restartButton');
+    this.restartButton = document.getElementById("");
     this.winningMessageTextElement = document.querySelector('[data-winning-message-text]');
     this.circleTurn = false;

[Survived] BooleanLiteral
src/domTicTacToe.js:20:23
     this.winningMessageElement = document.getElementById('winningMessage');
     this.restartButton = document.getElementById('restartButton');
     this.winningMessageTextElement = document.querySelector('[data-winning-message-text]');
-    this.circleTurn = false;
+    this.circleTurn = true;
     this.xScore = 0;
     this.oScore = 0;

[Killed] StringLiteral
src/domTicTacToe.js:24:49
     this.xScore = 0;
     this.oScore = 0;
     this.drawScore = 0;
-    this.scoreElement = document.getElementById('score');
+    this.scoreElement = document.getElementById("");
     this.startGame();
   }
killedBy: O wins counter increments correctly in the DOM
statusReason: TypeError: Cannot set properties of null (setting 'innerHTML')

[Killed] BlockStatement
src/domTicTacToe.js:28:15
     this.startGame();
   }
 
-  startGame() {
-    this.circleTurn = false;
-    this.cellElements.forEach(cell => {
-      cell.classList.remove(this.X_CLASS);
-      cell.classList.remove(this.CIRCLE_CLASS);
-      cell.removeEventListener('click', this.handleClick);
-      cell.addEventListener('click', this.handleClick.bind(this), { once: true });
-    })
-    this.setBoardHoverClass();
-    this.winningMessageElement.classList.remove('show');
-  }
+  startGame() {}
 
   handleClick(e) {
killedBy: Game starts correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
src/domTicTacToe.js:29:23
   }
 
   startGame() {
-    this.circleTurn = false;
+    this.circleTurn = true;
     this.cellElements.forEach(cell => {
       cell.classList.remove(this.X_CLASS);
killedBy: Game starts correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] BlockStatement
src/domTicTacToe.js:30:39
 
   startGame() {
     this.circleTurn = false;
-    this.cellElements.forEach(cell => {
-      cell.classList.remove(this.X_CLASS);
-      cell.classList.remove(this.CIRCLE_CLASS);
-      cell.removeEventListener('click', this.handleClick);
-      cell.addEventListener('click', this.handleClick.bind(this), { once: true });
-    })
+    this.cellElements.forEach(cell => {})
     this.setBoardHoverClass();
     this.winningMessageElement.classList.remove('show');

[Survived] BooleanLiteral
src/domTicTacToe.js:34:75
       cell.classList.remove(this.X_CLASS);
       cell.classList.remove(this.CIRCLE_CLASS);
       cell.removeEventListener('click', this.handleClick);
-      cell.addEventListener('click', this.handleClick.bind(this), { once: true });
+      cell.addEventListener('click', this.handleClick.bind(this), { once: false });
     })
     this.setBoardHoverClass();

[Killed] StringLiteral
src/domTicTacToe.js:37:49
       cell.addEventListener('click', this.handleClick.bind(this), { once: true });
     })
     this.setBoardHoverClass();
-    this.winningMessageElement.classList.remove('show');
+    this.winningMessageElement.classList.remove("");
   }
 
killedBy: Game starts correctly
statusReason: SyntaxError: The token provided must not be empty.

[Killed] BlockStatement
src/domTicTacToe.js:40:18
     this.winningMessageElement.classList.remove('show');
   }
 
-  handleClick(e) {
-    const cell = e.target;
-    /* istanbul ignore next */
-    if (cell.classList.contains(this.X_CLASS) || cell.classList.contains(this.CIRCLE_CLASS)) {
-      return;
-    }
-    const currentClass = this.circleTurn ? this.CIRCLE_CLASS : this.X_CLASS;
-    this.placeMark(cell, currentClass);
-    if (this.checkWin(currentClass)) {
-      this.endGame(false);
-    } else if (this.isDraw()) {
-      this.endGame(true);
-    } else {
-      this.swapTurns();
-      this.setBoardHoverClass();
-    }
-  }
+  handleClick(e) {}
 
   endGame(draw) {
killedBy: Mark is placed correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/domTicTacToe.js:43:9
   handleClick(e) {
     const cell = e.target;
     /* istanbul ignore next */
-    if (cell.classList.contains(this.X_CLASS) || cell.classList.contains(this.CIRCLE_CLASS)) {
+    if (true) {
       return;
     }
killedBy: Mark is placed correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] ConditionalExpression
src/domTicTacToe.js:43:9
   handleClick(e) {
     const cell = e.target;
     /* istanbul ignore next */
-    if (cell.classList.contains(this.X_CLASS) || cell.classList.contains(this.CIRCLE_CLASS)) {
+    if (false) {
       return;
     }

[Killed] ConditionalExpression
src/domTicTacToe.js:48:9
     }
     const currentClass = this.circleTurn ? this.CIRCLE_CLASS : this.X_CLASS;
     this.placeMark(cell, currentClass);
-    if (this.checkWin(currentClass)) {
+    if (false) {
       this.endGame(false);
     } else if (this.isDraw()) {
killedBy: Game identifies a win correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X's Wins!"
Received: undefined

[Killed] ConditionalExpression
src/domTicTacToe.js:48:9
     }
     const currentClass = this.circleTurn ? this.CIRCLE_CLASS : this.X_CLASS;
     this.placeMark(cell, currentClass);
-    if (this.checkWin(currentClass)) {
+    if (true) {
       this.endGame(false);
     } else if (this.isDraw()) {
killedBy: Game identifies O win correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
src/domTicTacToe.js:49:20
     const currentClass = this.circleTurn ? this.CIRCLE_CLASS : this.X_CLASS;
     this.placeMark(cell, currentClass);
     if (this.checkWin(currentClass)) {
-      this.endGame(false);
+      this.endGame(true);
     } else if (this.isDraw()) {
       this.endGame(true);
killedBy: Game identifies a win correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X's Wins!"
Received: "Draw!"

[Killed] BlockStatement
src/domTicTacToe.js:50:31
     this.placeMark(cell, currentClass);
     if (this.checkWin(currentClass)) {
       this.endGame(false);
-    } else if (this.isDraw()) {
-      this.endGame(true);
-    } else {
+    } else if (this.isDraw()) {} else {
       this.swapTurns();
       this.setBoardHoverClass();
killedBy: Game identifies a draw correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Draw!"
Received: undefined

[Killed] ConditionalExpression
src/domTicTacToe.js:50:16
     this.placeMark(cell, currentClass);
     if (this.checkWin(currentClass)) {
       this.endGame(false);
-    } else if (this.isDraw()) {
+    } else if (true) {
       this.endGame(true);
     } else {
killedBy: Game identifies O win correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
src/domTicTacToe.js:51:20
     if (this.checkWin(currentClass)) {
       this.endGame(false);
     } else if (this.isDraw()) {
-      this.endGame(true);
+      this.endGame(false);
     } else {
       this.swapTurns();
killedBy: Game identifies a draw correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Draw!"
Received: "X's Wins!"

[Killed] BlockStatement
src/domTicTacToe.js:52:12
       this.endGame(false);
     } else if (this.isDraw()) {
       this.endGame(true);
-    } else {
-      this.swapTurns();
-      this.setBoardHoverClass();
-    }
+    } else {}
   }
 
killedBy: Game identifies O win correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/domTicTacToe.js:58:17
     }
   }
 
-  endGame(draw) {
-    if (draw) {
-      this.winningMessageTextElement.innerText = 'Draw!';
-      this.drawScore++;
-    } else {
-      this.winningMessageTextElement.innerText = `${this.circleTurn ? "O's" : "X's"} Wins!`;
-      if (this.circleTurn) {
-        this.oScore++;
-      } else {
-        this.xScore++;
-      }
-    }
-    this.winningMessageElement.classList.add('show');
-  }
+  endGame(draw) {}
 
   updateScore() {
killedBy: Game identifies a win correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X's Wins!"
Received: undefined

[Killed] BlockStatement
src/domTicTacToe.js:59:15
   }
 
   endGame(draw) {
-    if (draw) {
-      this.winningMessageTextElement.innerText = 'Draw!';
-      this.drawScore++;
-    } else {
+    if (draw) {} else {
       this.winningMessageTextElement.innerText = `${this.circleTurn ? "O's" : "X's"} Wins!`;
       if (this.circleTurn) {
killedBy: Game identifies a draw correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Draw!"
Received: undefined

[Killed] ConditionalExpression
src/domTicTacToe.js:59:9
   }
 
   endGame(draw) {
-    if (draw) {
+    if (false) {
       this.winningMessageTextElement.innerText = 'Draw!';
       this.drawScore++;
killedBy: Game identifies a draw correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Draw!"
Received: "X's Wins!"

[Killed] StringLiteral
src/domTicTacToe.js:60:50
 
   endGame(draw) {
     if (draw) {
-      this.winningMessageTextElement.innerText = 'Draw!';
+      this.winningMessageTextElement.innerText = "";
       this.drawScore++;
     } else {
killedBy: Game identifies a draw correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Draw!"
Received: ""

[Killed] UpdateOperator
src/domTicTacToe.js:61:7
   endGame(draw) {
     if (draw) {
       this.winningMessageTextElement.innerText = 'Draw!';
-      this.drawScore++;
+      this.drawScore--;
     } else {
       this.winningMessageTextElement.innerText = `${this.circleTurn ? "O's" : "X's"} Wins!`;
killedBy: Draw counter increments correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/domTicTacToe.js:62:12
     if (draw) {
       this.winningMessageTextElement.innerText = 'Draw!';
       this.drawScore++;
-    } else {
-      this.winningMessageTextElement.innerText = `${this.circleTurn ? "O's" : "X's"} Wins!`;
-      if (this.circleTurn) {
-        this.oScore++;
-      } else {
-        this.xScore++;
-      }
-    }
+    } else {}
     this.winningMessageElement.classList.add('show');
   }
killedBy: Game identifies a win correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X's Wins!"
Received: undefined

[Killed] BlockStatement
src/domTicTacToe.js:64:28
       this.drawScore++;
     } else {
       this.winningMessageTextElement.innerText = `${this.circleTurn ? "O's" : "X's"} Wins!`;
-      if (this.circleTurn) {
-        this.oScore++;
-      } else {
+      if (this.circleTurn) {} else {
         this.xScore++;
       }
killedBy: O wins counter increments correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/domTicTacToe.js:64:11
       this.drawScore++;
     } else {
       this.winningMessageTextElement.innerText = `${this.circleTurn ? "O's" : "X's"} Wins!`;
-      if (this.circleTurn) {
+      if (true) {
         this.oScore++;
       } else {
killedBy: X wins counter increments correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] UpdateOperator
src/domTicTacToe.js:65:9
     } else {
       this.winningMessageTextElement.innerText = `${this.circleTurn ? "O's" : "X's"} Wins!`;
       if (this.circleTurn) {
-        this.oScore++;
+        this.oScore--;
       } else {
         this.xScore++;
killedBy: O wins counter increments correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/domTicTacToe.js:66:14
       this.winningMessageTextElement.innerText = `${this.circleTurn ? "O's" : "X's"} Wins!`;
       if (this.circleTurn) {
         this.oScore++;
-      } else {
-        this.xScore++;
-      }
+      } else {}
     }
     this.winningMessageElement.classList.add('show');
killedBy: X wins counter increments correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] UpdateOperator
src/domTicTacToe.js:67:9
       if (this.circleTurn) {
         this.oScore++;
       } else {
-        this.xScore++;
+        this.xScore--;
       }
     }
killedBy: X wins counter increments correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] StringLiteral
src/domTicTacToe.js:70:46
         this.xScore++;
       }
     }
-    this.winningMessageElement.classList.add('show');
+    this.winningMessageElement.classList.add("");
   }
 
killedBy: Game identifies a win correctly
statusReason: SyntaxError: The token provided must not be empty.

[Killed] BlockStatement
src/domTicTacToe.js:73:17
     this.winningMessageElement.classList.add('show');
   }
 
-  updateScore() {
-      this.scoreElement.innerHTML = `
-          <p>X wins: ${this.xScore}</p>
-          <p>O wins: ${this.oScore}</p>
-          <p>Draws: ${this.drawScore}</p>
-      `;
-  }
+  updateScore() {}
 
   isDraw() {
killedBy: O wins counter increments correctly in the DOM
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "O wins: 1"
Received: "O wins: 0"

[Killed] StringLiteral
src/domTicTacToe.js:74:37
   }
 
   updateScore() {
-      this.scoreElement.innerHTML = `
-          <p>X wins: ${this.xScore}</p>
-          <p>O wins: ${this.oScore}</p>
-          <p>Draws: ${this.drawScore}</p>
-      `;
+      this.scoreElement.innerHTML = ``;
   }
 
killedBy: O wins counter increments correctly in the DOM
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Killed] BlockStatement
src/domTicTacToe.js:81:12
       `;
   }
 
-  isDraw() {
-    return [...this.cellElements].every(cell => {
-      return cell.classList.contains(this.X_CLASS) || cell.classList.contains(this.CIRCLE_CLASS);
-    })
-  }
+  isDraw() {}
 
   placeMark(cell, currentClass) {
killedBy: Game identifies a draw correctly
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] MethodExpression
src/domTicTacToe.js:82:12
   }
 
   isDraw() {
-    return [...this.cellElements].every(cell => {
-      return cell.classList.contains(this.X_CLASS) || cell.classList.contains(this.CIRCLE_CLASS);
-    })
+    return [...this.cellElements].some(cell => {
+  return cell.classList.contains(this.X_CLASS) || cell.classList.contains(this.CIRCLE_CLASS);
+})
   }
 
killedBy: Game identifies O win correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/domTicTacToe.js:82:49
   }
 
   isDraw() {
-    return [...this.cellElements].every(cell => {
-      return cell.classList.contains(this.X_CLASS) || cell.classList.contains(this.CIRCLE_CLASS);
-    })
+    return [...this.cellElements].every(cell => {})
   }
 
killedBy: Game identifies a draw correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] LogicalOperator
src/domTicTacToe.js:83:14
 
   isDraw() {
     return [...this.cellElements].every(cell => {
-      return cell.classList.contains(this.X_CLASS) || cell.classList.contains(this.CIRCLE_CLASS);
+      return cell.classList.contains(this.X_CLASS) && cell.classList.contains(this.CIRCLE_CLASS);
     })
   }
killedBy: Game identifies a draw correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/domTicTacToe.js:83:14
 
   isDraw() {
     return [...this.cellElements].every(cell => {
-      return cell.classList.contains(this.X_CLASS) || cell.classList.contains(this.CIRCLE_CLASS);
+      return true;
     })
   }
killedBy: Game identifies O win correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/domTicTacToe.js:87:33
     })
   }
 
-  placeMark(cell, currentClass) {
-    cell.classList.add(currentClass);
-  }
+  placeMark(cell, currentClass) {}
 
   swapTurns() {
killedBy: Mark is placed correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/domTicTacToe.js:91:15
     cell.classList.add(currentClass);
   }
 
-  swapTurns() {
-    this.circleTurn = !this.circleTurn;
-  }
+  swapTurns() {}
 
   setBoardHoverClass() {
killedBy: Game identifies O win correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
src/domTicTacToe.js:92:23
   }
 
   swapTurns() {
-    this.circleTurn = !this.circleTurn;
+    this.circleTurn = this.circleTurn;
   }
 
killedBy: Game identifies O win correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/domTicTacToe.js:95:24
     this.circleTurn = !this.circleTurn;
   }
 
-  setBoardHoverClass() {
-    this.board.classList.remove(this.X_CLASS);
-    this.board.classList.remove(this.CIRCLE_CLASS);
-    if (this.circleTurn) {
-      this.board.classList.add(this.CIRCLE_CLASS);
-    } else {
-      this.board.classList.add(this.X_CLASS);
-    }
-  }
+  setBoardHoverClass() {}
 
   checkWin(currentClass) {
killedBy: Game starts correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/domTicTacToe.js:98:26
   setBoardHoverClass() {
     this.board.classList.remove(this.X_CLASS);
     this.board.classList.remove(this.CIRCLE_CLASS);
-    if (this.circleTurn) {
-      this.board.classList.add(this.CIRCLE_CLASS);
-    } else {
+    if (this.circleTurn) {} else {
       this.board.classList.add(this.X_CLASS);
     }
killedBy: Board Hover Class Tests setBoardHoverClass adds Circle class when it is Circle's turn
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/domTicTacToe.js:98:9
   setBoardHoverClass() {
     this.board.classList.remove(this.X_CLASS);
     this.board.classList.remove(this.CIRCLE_CLASS);
-    if (this.circleTurn) {
+    if (true) {
       this.board.classList.add(this.CIRCLE_CLASS);
     } else {
killedBy: Game starts correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/domTicTacToe.js:100:12
     this.board.classList.remove(this.CIRCLE_CLASS);
     if (this.circleTurn) {
       this.board.classList.add(this.CIRCLE_CLASS);
-    } else {
-      this.board.classList.add(this.X_CLASS);
-    }
+    } else {}
   }
 
killedBy: Game starts correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/domTicTacToe.js:105:26
     }
   }
 
-  checkWin(currentClass) {
-    return this.WINNING_COMBINATIONS.some(combination => {
-      return combination.every(index => {
-        return this.cellElements[index].classList.contains(currentClass);
-      });
-    });
-  }
+  checkWin(currentClass) {}
 }
 
killedBy: Game identifies a win correctly
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BlockStatement
src/domTicTacToe.js:106:58
   }
 
   checkWin(currentClass) {
-    return this.WINNING_COMBINATIONS.some(combination => {
-      return combination.every(index => {
-        return this.cellElements[index].classList.contains(currentClass);
-      });
-    });
+    return this.WINNING_COMBINATIONS.some(combination => {});
   }
 }
killedBy: Game identifies a win correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] MethodExpression
src/domTicTacToe.js:106:12
   }
 
   checkWin(currentClass) {
-    return this.WINNING_COMBINATIONS.some(combination => {
-      return combination.every(index => {
-        return this.cellElements[index].classList.contains(currentClass);
-      });
-    });
+    return this.WINNING_COMBINATIONS.every(combination => {
+  return combination.every(index => {
+    return this.cellElements[index].classList.contains(currentClass);
+  });
+});
   }
 }
killedBy: Game identifies a win correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/domTicTacToe.js:107:41
 
   checkWin(currentClass) {
     return this.WINNING_COMBINATIONS.some(combination => {
-      return combination.every(index => {
-        return this.cellElements[index].classList.contains(currentClass);
-      });
+      return combination.every(index => {});
     });
   }
killedBy: Game identifies a win correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] MethodExpression
src/domTicTacToe.js:107:14
 
   checkWin(currentClass) {
     return this.WINNING_COMBINATIONS.some(combination => {
-      return combination.every(index => {
-        return this.cellElements[index].classList.contains(currentClass);
-      });
+      return combination.some(index => {
+  return this.cellElements[index].classList.contains(currentClass);
+});
     });
   }
killedBy: Game identifies O win correctly
statusReason: Error: expect(received).toBeTruthy()

Received: false
