[Killed] BlockStatement
src/ticTacToe.js:4:19
 const readline = require('readline');
 
 class TicTacToe {
-    constructor() {
-        this.board = [
-            [' ', ' ', ' '],
-            [' ', ' ', ' '],
-            [' ', ' ', ' ']
-        ];
-        this.currentPlayer = 'X';
-        this.rl = readline.createInterface({
-            input: process.stdin,
-            output: process.stdout
-        });
-    }
+    constructor() {}
 
     /* istanbul ignore next */
killedBy: Tic Tac Toe constructor initializes all game components correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [[" ", " ", " "], [" ", " ", " "], [" ", " ", " "]]
Received: undefined

[Killed] StringLiteral
src/ticTacToe.js:6:14
 class TicTacToe {
     constructor() {
         this.board = [
-            [' ', ' ', ' '],
+            ["", ' ', ' '],
             [' ', ' ', ' '],
             [' ', ' ', ' ']
killedBy: Tic Tac Toe constructor initializes all game components correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Array [
    Array [

[Killed] ArrayDeclaration
src/ticTacToe.js:6:13
 class TicTacToe {
     constructor() {
         this.board = [
-            [' ', ' ', ' '],
+            [],
             [' ', ' ', ' '],
             [' ', ' ', ' ']
killedBy: Tic Tac Toe constructor initializes all game components correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

@@ -1,11 +1,7 @@
  Array [
-   Array [

[Killed] StringLiteral
src/ticTacToe.js:8:19
         this.board = [
             [' ', ' ', ' '],
             [' ', ' ', ' '],
-            [' ', ' ', ' ']
+            [' ', "", ' ']
         ];
         this.currentPlayer = 'X';
killedBy: Tic Tac Toe constructor initializes all game components correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -9,9 +9,9 @@
      " ",
      " ",

[Killed] ArrayDeclaration
src/ticTacToe.js:8:13
         this.board = [
             [' ', ' ', ' '],
             [' ', ' ', ' '],
-            [' ', ' ', ' ']
+            []
         ];
         this.currentPlayer = 'X';
killedBy: Tic Tac Toe constructor initializes all game components correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

@@ -7,11 +7,7 @@
    Array [
      " ",

[Killed] StringLiteral
src/ticTacToe.js:10:30
             [' ', ' ', ' '],
             [' ', ' ', ' ']
         ];
-        this.currentPlayer = 'X';
+        this.currentPlayer = "";
         this.rl = readline.createInterface({
             input: process.stdin,
killedBy: Tic Tac Toe constructor initializes all game components correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "X"
Received: ""

[Killed] ObjectLiteral
src/ticTacToe.js:11:44
             [' ', ' ', ' ']
         ];
         this.currentPlayer = 'X';
-        this.rl = readline.createInterface({
-            input: process.stdin,
-            output: process.stdout
-        });
+        this.rl = readline.createInterface({});
     }
 
killedBy: Tic Tac Toe constructor initializes all game components correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "input": Socket {
-     "_closeAfterHandlingError": false,

[NoCoverage] BlockStatement
src/ticTacToe.js:18:18
     }
 
     /* istanbul ignore next */
-    printBoard() {
-        let output = '';
-        this.board.forEach((row, idx) => {
-            output += `${row[0]} | ${row[1]} | ${row[2]}\n`;
-            if (idx < 2) output += '---------\n';
-        });
-        console.log(output);
-    }
+    printBoard() {}
 
     switchPlayer() {

[NoCoverage] StringLiteral
src/ticTacToe.js:19:22
 
     /* istanbul ignore next */
     printBoard() {
-        let output = '';
+        let output = "Stryker was here!";
         this.board.forEach((row, idx) => {
             output += `${row[0]} | ${row[1]} | ${row[2]}\n`;

[NoCoverage] BlockStatement
src/ticTacToe.js:20:42
     /* istanbul ignore next */
     printBoard() {
         let output = '';
-        this.board.forEach((row, idx) => {
-            output += `${row[0]} | ${row[1]} | ${row[2]}\n`;
-            if (idx < 2) output += '---------\n';
-        });
+        this.board.forEach((row, idx) => {});
         console.log(output);
     }

[NoCoverage] ConditionalExpression
src/ticTacToe.js:22:17
         let output = '';
         this.board.forEach((row, idx) => {
             output += `${row[0]} | ${row[1]} | ${row[2]}\n`;
-            if (idx < 2) output += '---------\n';
+            if (false) output += '---------\n';
         });
         console.log(output);

[NoCoverage] EqualityOperator
src/ticTacToe.js:22:17
         let output = '';
         this.board.forEach((row, idx) => {
             output += `${row[0]} | ${row[1]} | ${row[2]}\n`;
-            if (idx < 2) output += '---------\n';
+            if (idx >= 2) output += '---------\n';
         });
         console.log(output);

[Killed] BlockStatement
src/ticTacToe.js:27:20
         console.log(output);
     }
 
-    switchPlayer() {
-        this.currentPlayer = this.currentPlayer === 'X' ? 'O' : 'X';
-    }
+    switchPlayer() {}
 
     checkWin() {
killedBy: Tic Tac Toe switches player correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "O"
Received: "X"

[Killed] EqualityOperator
src/ticTacToe.js:28:30
     }
 
     switchPlayer() {
-        this.currentPlayer = this.currentPlayer === 'X' ? 'O' : 'X';
+        this.currentPlayer = this.currentPlayer !== 'X' ? 'O' : 'X';
     }
 
killedBy: Tic Tac Toe switches player correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "O"
Received: "X"

[Killed] ConditionalExpression
src/ticTacToe.js:28:30
     }
 
     switchPlayer() {
-        this.currentPlayer = this.currentPlayer === 'X' ? 'O' : 'X';
+        this.currentPlayer = false ? 'O' : 'X';
     }
 
killedBy: Tic Tac Toe switches player correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "O"
Received: "X"

[Killed] BlockStatement
src/ticTacToe.js:31:16
         this.currentPlayer = this.currentPlayer === 'X' ? 'O' : 'X';
     }
 
-    checkWin() {
-        const b = this.board;
-        const lines = [
-            [b[0][0], b[0][1], b[0][2]],
-            [b[1][0], b[1][1], b[1][2]],
-            [b[2][0], b[2][1], b[2][2]],
-            [b[0][0], b[1][0], b[2][0]],
-            [b[0][1], b[1][1], b[2][1]],
-            [b[0][2], b[1][2], b[2][2]],
-            [b[0][0], b[1][1], b[2][2]],
-            [b[0][2], b[1][1], b[2][0]]
-        ];
-        return lines.some(line => line.every(cell => cell === this.currentPlayer));
-    }
+    checkWin() {}
 
     isBoardFull() {
killedBy: Tic Tac Toe identifies a winning condition correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArrayDeclaration
src/ticTacToe.js:34:13
     checkWin() {
         const b = this.board;
         const lines = [
-            [b[0][0], b[0][1], b[0][2]],
+            [],
             [b[1][0], b[1][1], b[1][2]],
             [b[2][0], b[2][1], b[2][2]],
killedBy: Tic Tac Toe does not falsely identify a winning condition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrayDeclaration
src/ticTacToe.js:37:13
             [b[0][0], b[0][1], b[0][2]],
             [b[1][0], b[1][1], b[1][2]],
             [b[2][0], b[2][1], b[2][2]],
-            [b[0][0], b[1][0], b[2][0]],
+            [],
             [b[0][1], b[1][1], b[2][1]],
             [b[0][2], b[1][2], b[2][2]],
killedBy: Tic Tac Toe does not falsely identify a winning condition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrayDeclaration
src/ticTacToe.js:40:13
             [b[0][0], b[1][0], b[2][0]],
             [b[0][1], b[1][1], b[2][1]],
             [b[0][2], b[1][2], b[2][2]],
-            [b[0][0], b[1][1], b[2][2]],
+            [],
             [b[0][2], b[1][1], b[2][0]]
         ];
killedBy: Tic Tac Toe does not falsely identify a winning condition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/ticTacToe.js:43:54
             [b[0][0], b[1][1], b[2][2]],
             [b[0][2], b[1][1], b[2][0]]
         ];
-        return lines.some(line => line.every(cell => cell === this.currentPlayer));
+        return lines.some(line => line.every(cell => cell !== this.currentPlayer));
     }
 
killedBy: Tic Tac Toe does not falsely identify a winning condition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/ticTacToe.js:43:54
             [b[0][0], b[1][1], b[2][2]],
             [b[0][2], b[1][1], b[2][0]]
         ];
-        return lines.some(line => line.every(cell => cell === this.currentPlayer));
+        return lines.some(line => line.every(cell => true));
     }
 
killedBy: Tic Tac Toe does not falsely identify a winning condition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/ticTacToe.js:46:19
         return lines.some(line => line.every(cell => cell === this.currentPlayer));
     }
 
-    isBoardFull() {
-        return this.board.every(row => row.every(cell => cell !== ' '));
-    }
+    isBoardFull() {}
 
     makeMove(row, col) {
killedBy: Tic Tac Toe draw condition works
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArrowFunction
src/ticTacToe.js:47:50
     }
 
     isBoardFull() {
-        return this.board.every(row => row.every(cell => cell !== ' '));
+        return this.board.every(row => row.every(() => undefined));
     }
 
killedBy: Tic Tac Toe draw condition works
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/ticTacToe.js:47:58
     }
 
     isBoardFull() {
-        return this.board.every(row => row.every(cell => cell !== ' '));
+        return this.board.every(row => row.every(cell => true));
     }
 
killedBy: Tic Tac Toe isBoardFull returns false when only one row is full
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/ticTacToe.js:50:24
         return this.board.every(row => row.every(cell => cell !== ' '));
     }
 
-    makeMove(row, col) {
-        if (this.board[row][col] === ' ') {
-            this.board[row][col] = this.currentPlayer;
-            return true;
-        }
-        return false;
-    }
+    makeMove(row, col) {}
 
     /* istanbul ignore next */
killedBy: Tic Tac Toe makes a move and updates the board
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/ticTacToe.js:51:13
     }
 
     makeMove(row, col) {
-        if (this.board[row][col] === ' ') {
+        if (true) {
             this.board[row][col] = this.currentPlayer;
             return true;
killedBy: Tic Tac Toe prevents move on an occupied cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/ticTacToe.js:51:13
     }
 
     makeMove(row, col) {
-        if (this.board[row][col] === ' ') {
+        if (this.board[row][col] !== ' ') {
             this.board[row][col] = this.currentPlayer;
             return true;
killedBy: Tic Tac Toe makes a move and updates the board
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/ticTacToe.js:53:20
     makeMove(row, col) {
         if (this.board[row][col] === ' ') {
             this.board[row][col] = this.currentPlayer;
-            return true;
+            return false;
         }
         return false;
killedBy: Tic Tac Toe makes a move and updates the board
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BlockStatement
src/ticTacToe.js:59:17
     }
 
     /* istanbul ignore next */
-    startGame() {
-        this.getInput();
-    }
+    startGame() {}
 
     getInput(callback) {

[Killed] BlockStatement
src/ticTacToe.js:63:24
         this.getInput();
     }
 
-    getInput(callback) {
-        this.printBoard();
-        this.rl.question(`Player ${this.currentPlayer}, enter your move (row,col): `, input => {
-            const [row, col] = input.split(',').map(Number);
-            if (row >= 0 && row < 3 && col >= 0 && col < 3 && this.makeMove(row, col)) {
-                if (this.checkWin()) {
-                    this.printBoard();
-                    console.log(`Player ${this.currentPlayer} wins!`);
-                    this.rl.close();
-                } else if (this.isBoardFull()) {
-                    this.printBoard();
-                    console.log("It's a draw!");
-                    this.rl.close();
-                } else {
-                    this.switchPlayer();
-                    callback(); 
-                }
-            } else {
-                console.log("Invalid move. Please enter row,col within 0,1,2.");
-                this.getInput(callback); 
-            }
-        });
-    }
+    getInput(callback) {}
 }
 
killedBy: Tic Tac Toe handles input for a valid move, win, and draw correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/ticTacToe.js:65:96
 
     getInput(callback) {
         this.printBoard();
-        this.rl.question(`Player ${this.currentPlayer}, enter your move (row,col): `, input => {
-            const [row, col] = input.split(',').map(Number);
-            if (row >= 0 && row < 3 && col >= 0 && col < 3 && this.makeMove(row, col)) {
-                if (this.checkWin()) {
-                    this.printBoard();
-                    console.log(`Player ${this.currentPlayer} wins!`);
-                    this.rl.close();
-                } else if (this.isBoardFull()) {
-                    this.printBoard();
-                    console.log("It's a draw!");
-                    this.rl.close();
-                } else {
-                    this.switchPlayer();
-                    callback(); 
-                }
-            } else {
-                console.log("Invalid move. Please enter row,col within 0,1,2.");
-                this.getInput(callback); 
-            }
-        });
+        this.rl.question(`Player ${this.currentPlayer}, enter your move (row,col): `, input => {});
     }
 }
killedBy: Tic Tac Toe handles input for a valid move, win, and draw correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/ticTacToe.js:66:44
     getInput(callback) {
         this.printBoard();
         this.rl.question(`Player ${this.currentPlayer}, enter your move (row,col): `, input => {
-            const [row, col] = input.split(',').map(Number);
+            const [row, col] = input.split("").map(Number);
             if (row >= 0 && row < 3 && col >= 0 && col < 3 && this.makeMove(row, col)) {
                 if (this.checkWin()) {
killedBy: Tic Tac Toe handles input for a valid move, win, and draw correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] LogicalOperator
src/ticTacToe.js:67:17
         this.printBoard();
         this.rl.question(`Player ${this.currentPlayer}, enter your move (row,col): `, input => {
             const [row, col] = input.split(',').map(Number);
-            if (row >= 0 && row < 3 && col >= 0 && col < 3 && this.makeMove(row, col)) {
+            if (row >= 0 && row < 3 && col >= 0 && col < 3 || this.makeMove(row, col)) {
                 if (this.checkWin()) {
                     this.printBoard();
killedBy: Tic Tac Toe rejects invalid input and repeats the prompt
statusReason: TypeError: Cannot read properties of undefined (reading '3')

[Killed] EqualityOperator
src/ticTacToe.js:67:40
         this.printBoard();
         this.rl.question(`Player ${this.currentPlayer}, enter your move (row,col): `, input => {
             const [row, col] = input.split(',').map(Number);
-            if (row >= 0 && row < 3 && col >= 0 && col < 3 && this.makeMove(row, col)) {
+            if (row >= 0 && row < 3 && col < 0 && col < 3 && this.makeMove(row, col)) {
                 if (this.checkWin()) {
                     this.printBoard();
killedBy: Tic Tac Toe handles input for a valid move, win, and draw correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/ticTacToe.js:68:21
         this.rl.question(`Player ${this.currentPlayer}, enter your move (row,col): `, input => {
             const [row, col] = input.split(',').map(Number);
             if (row >= 0 && row < 3 && col >= 0 && col < 3 && this.makeMove(row, col)) {
-                if (this.checkWin()) {
+                if (true) {
                     this.printBoard();
                     console.log(`Player ${this.currentPlayer} wins!`);
killedBy: Tic Tac Toe handles input for a valid move, win, and draw correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "It's a draw!"
Received
       1: "Player X wins!"
       2: "Player X wins!"

Number of calls: 2

[Killed] BlockStatement
src/ticTacToe.js:68:38
         this.rl.question(`Player ${this.currentPlayer}, enter your move (row,col): `, input => {
             const [row, col] = input.split(',').map(Number);
             if (row >= 0 && row < 3 && col >= 0 && col < 3 && this.makeMove(row, col)) {
-                if (this.checkWin()) {
-                    this.printBoard();
-                    console.log(`Player ${this.currentPlayer} wins!`);
-                    this.rl.close();
-                } else if (this.isBoardFull()) {
+                if (this.checkWin()) {} else if (this.isBoardFull()) {
                     this.printBoard();
                     console.log("It's a draw!");
killedBy: Tic Tac Toe handles input for a valid move, win, and draw correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/ticTacToe.js:72:28
                     this.printBoard();
                     console.log(`Player ${this.currentPlayer} wins!`);
                     this.rl.close();
-                } else if (this.isBoardFull()) {
+                } else if (false) {
                     this.printBoard();
                     console.log("It's a draw!");
killedBy: Tic Tac Toe handles input for a valid move, win, and draw correctly
statusReason: TypeError: callback is not a function

[Killed] BlockStatement
src/ticTacToe.js:72:48
                     this.printBoard();
                     console.log(`Player ${this.currentPlayer} wins!`);
                     this.rl.close();
-                } else if (this.isBoardFull()) {
-                    this.printBoard();
-                    console.log("It's a draw!");
-                    this.rl.close();
-                } else {
+                } else if (this.isBoardFull()) {} else {
                     this.switchPlayer();
                     callback(); 
killedBy: Tic Tac Toe handles input for a valid move, win, and draw correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "It's a draw!"
Received: "Player X wins!"

Number of calls: 1

[Survived] BlockStatement
src/ticTacToe.js:76:24
                     this.printBoard();
                     console.log("It's a draw!");
                     this.rl.close();
-                } else {
-                    this.switchPlayer();
-                    callback(); 
-                }
+                } else {}
             } else {
                 console.log("Invalid move. Please enter row,col within 0,1,2.");

[Killed] BlockStatement
src/ticTacToe.js:80:20
                     this.switchPlayer();
                     callback(); 
                 }
-            } else {
-                console.log("Invalid move. Please enter row,col within 0,1,2.");
-                this.getInput(callback); 
-            }
+            } else {}
         });
     }
killedBy: Tic Tac Toe rejects invalid input and repeats the prompt
statusReason: ReferenceError: setImmediate is not defined
