[Killed] MethodExpression
src/ticTacToe.js:43:16
             [b[0][0], b[1][1], b[2][2]],
             [b[0][2], b[1][1], b[2][0]]
         ];
-        return lines.some(line => line.every(cell => cell === this.currentPlayer));
+        return lines.every(line => line.every(cell => cell === this.currentPlayer));
     }
 
killedBy: Tic Tac Toe identifies a winning condition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/ticTacToe.js:47:58
     }
 
     isBoardFull() {
-        return this.board.every(row => row.every(cell => cell !== ' '));
+        return this.board.every(row => row.every(cell => false));
     }
 
killedBy: Tic Tac Toe draw condition works
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
